In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [2]:
# load data
basics = pd.read_csv('Data/title_basics.csv.gz') 
ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb_2000 = pd.read_csv('Data/final_tmdb_data_2000.csv.gz')
tmdb_2001 = pd.read_csv('Data/final_tmdb_data_2001.csv.gz')

## Normalizing Genres

In [3]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

In [4]:
# create column with a list of genrest
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]

In [5]:
# explode genres into one row for each genre
exploded_genres = basics.explode('genres_split')
exploded_genres.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,Drama

In [6]:
# save list of unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [7]:
# create title_genres table
# save tconst and genres_split columns
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [8]:
# making a genre mapper dictionary
# make a dictionary with genre string as the key and the integers genre_ids as the values
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [9]:
# create interger genre_id column in title_genres
# drop genre_split column
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

In [10]:
# create dataframe from genre map dictionary
genres = pd.DataFrame({'genre_name':genre_map.keys(),
                       'genre_id':genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## Finalise title_basics, title_ratings and tmdb_data

In [11]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror,[Horror]

In [12]:
title_basics = basics.drop(columns=['titleType','originalTitle','isAdult','endYear','genres','genres_split']).copy()
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0068865,Lives of Performers,2016,90
3,tt0069049,The Other Side of the Wind,2018,122
4,tt0082328,Embodiment of Evil,2008,94

In [13]:
title_ratings = ratings.copy()
title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       182
4  tt0000007            5.4       838

In [14]:
tmdb_data = pd.concat([tmdb_2000,tmdb_2001])
tmdb_data = tmdb_data[~(tmdb_data['imdb_id']=='0')]
tmdb_data = tmdb_data[['imdb_id','revenue','budget','certification']] 
tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  14204632.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [15]:
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [16]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0068865         7

## Create SQL database

In [17]:
connection = "mysql+pymysql://root:root@localhost/movies"
engine = create_engine(connection)

In [18]:
# check if database exists, if not, create it
if database_exists(connection) == False:
    create_database(connection)

else:
    print('The database already exists')

The database already exists

In [19]:
# create data type dictionaries
# title_basics
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()

# create schema dictionary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1),
    "primaryTitle": Text(title_len+1),
    "startYear": Float(),
    "runtimeMinutes": Integer()}

# title_ratings
key_len2 = title_ratings['tconst'].fillna('').map(len).max()

# create schema dictionary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len2+1),
    "averageRating": Float(),
    "numVotes": Integer()}

# tmdb_data
key_len3 = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()

tmdb_schema = {
    "imdb_id": String(key_len3+1),
    "revenue": Float(),
    "certification": Text(cert_len+1)}

In [24]:
title_basics.to_sql('title_basics', engine, dtype=basics_schema, if_exists = 'replace') # index = tconts
title_genres.to_sql('title_genres', engine, if_exists = 'replace') # no index
genres.set_index('genre_id').to_sql('genres', engine, index=True, if_exists = 'replace') # index = genre_id
title_ratings.to_sql('title_ratings', engine, dtype=ratings_schema, if_exists = 'replace') # index = tconts
tmdb_data.to_sql('tmdb_data', engine, dtype=tmdb_schema, if_exists = 'replace') # index = tconts

2621

In [25]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [26]:
q = """SELECT * FROM title_basics
        LIMIT 5"""
pd.read_sql(q, engine)

,index,tconst,primaryTitle,startYear,runtimeMinutes
0,0,tt0035423,Kate & Leopold,2001.0,118
1,1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,2,tt0068865,Lives of Performers,2016.0,90
3,3,tt0069049,The Other Side of the Wind,2018.0,122
4,4,tt0082328,Embodiment of Evil,2008.0,94

In [31]:
q = """SELECT * FROM title_genres
        LIMIT 5"""
pd.read_sql(q, engine)

   index     tconst  genre_id
0      0  tt0035423         5
1      0  tt0035423         9
2      0  tt0035423        18
3      1  tt0062336         7
4      2  tt0068865         7

In [28]:
q = """SELECT * FROM genres
        LIMIT 5"""
pd.read_sql(q, engine)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [29]:
q = """SELECT * FROM title_ratings
        LIMIT 5"""
pd.read_sql(q, engine)

   index     tconst  averageRating  numVotes
0      0  tt0000001            5.7      2002
1      1  tt0000002            5.8       269
2      2  tt0000005            6.2      2678
3      3  tt0000006            5.0       182
4      4  tt0000007            5.4       838

In [30]:
q = """SELECT * FROM tmdb_data
        LIMIT 5"""
pd.read_sql(q, engine)

   index    imdb_id     revenue      budget certification
0      1  tt0035423  76019000.0  48000000.0         PG-13
1      1  tt0113026         0.0  10000000.0          None
2      2  tt0113092         0.0         0.0          None
3      2  tt0114447         0.0         0.0          None
4      3  tt0116391         0.0         0.0          None

In [32]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data